# GetRibbonPanels Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ApplicationEntryPoint..::..GetRibbonPanels Method
ApplicationEntryPoint Class See Also
---
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override List<RibbonPanel> GetRibbonPanels()
```

Visual Basic
---
```text
Public Overrides Function GetRibbonPanels As List(Of RibbonPanel)
```

Visual C++
---
```text
public:
virtual List<RibbonPanel^>^ GetRibbonPanels() override
```

# See Also
ApplicationEntryPoint Class
GetRibbonPanels Overload
Autodesk.Revit.UI.Macros Namespace